Full plan
```
 # module.stateful.module.admin.aws_s3_bucket.main will be updated in-place
  ~ resource "aws_s3_bucket" "main" {
      ~ acl                         = "log-delivery-write" -> "private"
        arn                         = "arn:aws:s3:::bfd-test-admin-577373831711"
        bucket                      = "bfd-test-admin-577373831711"
        bucket_domain_name          = "bfd-test-admin-577373831711.s3.amazonaws.com"
        bucket_regional_domain_name = "bfd-test-admin-577373831711.s3.amazonaws.com"
        force_destroy               = false
        hosted_zone_id              = "Z3AQBSTGFYJSTF"
        id                          = "bfd-test-admin-577373831711"
        region                      = "us-east-1"
        request_payer               = "BucketOwner"
        tags                        = {
            "Environment" = "test"
            "Layer"       = "data"
            "application" = "bfd"
            "business"    = "oeda"
            "role"        = "admin"
            "stack"       = "test"
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

        server_side_encryption_configuration {
            rule {
                apply_server_side_encryption_by_default {
                    kms_master_key_id = "arn:aws:kms:us-east-1:577373831711:key/7dcca42a-da93-40b1-a4a8-2eb10050f449"
                    sse_algorithm     = "aws:kms"
                }
            }
        }

        versioning {
            enabled    = false
            mfa_delete = false
        }
    }

  # module.stateful.module.admin.aws_s3_bucket_public_access_block.main will be created
  + resource "aws_s3_bucket_public_access_block" "main" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "bfd-test-admin-577373831711"
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # module.stateful.module.elb.aws_s3_bucket.main will be destroyed
  - resource "aws_s3_bucket" "main" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::bfd-test-elb-577373831711" -> null
      - bucket                      = "bfd-test-elb-577373831711" -> null
      - bucket_domain_name          = "bfd-test-elb-577373831711.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "bfd-test-elb-577373831711.s3.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "bfd-test-elb-577373831711" -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Environment" = "test"
          - "Layer"       = "data"
          - "application" = "bfd"
          - "business"    = "oeda"
          - "role"        = "elb"
          - "stack"       = "test"
        } -> null

      - server_side_encryption_configuration {
          - rule {
              - apply_server_side_encryption_by_default {
                  - kms_master_key_id = "arn:aws:kms:us-east-1:577373831711:key/7dcca42a-da93-40b1-a4a8-2eb10050f449" -> null
                  - sse_algorithm     = "aws:kms" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.stateful.module.etl.aws_s3_bucket.main will be updated in-place
  ~ resource "aws_s3_bucket" "main" {
        acl                         = "private"
        arn                         = "arn:aws:s3:::bfd-test-etl-577373831711"
        bucket                      = "bfd-test-etl-577373831711"
        bucket_domain_name          = "bfd-test-etl-577373831711.s3.amazonaws.com"
        bucket_regional_domain_name = "bfd-test-etl-577373831711.s3.amazonaws.com"
        force_destroy               = false
        hosted_zone_id              = "Z3AQBSTGFYJSTF"
        id                          = "bfd-test-etl-577373831711"
        region                      = "us-east-1"
        request_payer               = "BucketOwner"
        tags                        = {
            "Environment" = "test"
            "Layer"       = "data"
            "application" = "bfd"
            "business"    = "oeda"
            "role"        = "etl"
            "stack"       = "test"
        }

      - logging {
          - target_bucket = "bfd-test-admin-577373831711" -> null
          - target_prefix = "logs/etl" -> null
        }
      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

        server_side_encryption_configuration {
            rule {
                apply_server_side_encryption_by_default {
                    kms_master_key_id = "arn:aws:kms:us-east-1:577373831711:key/7dcca42a-da93-40b1-a4a8-2eb10050f449"
                    sse_algorithm     = "aws:kms"
                }
            }
        }

        versioning {
            enabled    = false
            mfa_delete = false
        }
    }

  # module.stateful.module.etl.aws_s3_bucket_public_access_block.main will be created
  + resource "aws_s3_bucket_public_access_block" "main" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "bfd-test-etl-577373831711"
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # module.stateful.module.logs.aws_s3_bucket.main will be created
  + resource "aws_s3_bucket" "main" {
      + acceleration_status         = (known after apply)
      + acl                         = "log-delivery-write"
      + arn                         = (known after apply)
      + bucket                      = "bfd-test-logs-577373831711"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "test"
          + "Layer"       = "data"
          + "application" = "bfd"
          + "business"    = "oeda"
          + "role"        = "logs"
          + "stack"       = "test"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.stateful.module.logs.aws_s3_bucket_public_access_block.main will be created
  + resource "aws_s3_bucket_public_access_block" "main" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

Plan: 4 to add, 2 to change, 1 to destroy.
```